{"id":258,"date":"2017-01-01T14:24:45","date_gmt":"2017-01-01T14:24:45","guid":{"rendered":"https:\/\/missglobal.com\/?p=258"},"modified":"2018-05-21T19:21:06","modified_gmt":"2018-05-21T19:21:06","slug":"miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines","status":"publish","type":"post","link":"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/","title":{"rendered":"Miss USA &#8211; Nataliya Baltsevych&#8217;s Journey at Miss Global 2016 in the Philippines"},"content":{"rendered":"<p>When I shared the news with my friends and family that I was entering the Miss Global 2016 Beauty Pageant, they were all very excited for me. The people that know me best knew that I was in it to win it, and that I would be singularly focused on bringing home the crown; and because of my competitive spirit, they fully expected me to do so. As soon as I decided to enter, nothing mattered more to me than coming home with no less than the crown and the sash – for myself, for my loved ones, and for my country.<\/p>\n<p>During the pageant I had the opportunity to tour the Philippines. With my new friends, I visited exotic locations like Bohol Island, saw landmarks and monuments, and sampled various types of new cuisines. We also visited schools, including a special school for the deaf. Prior to visiting the school, we stopped at a toy store to get as many toys as we could afford for the children. The night before, I had been named second runner-up in the evening gown competition and was awarded 5000 Philippine Pesos – all of which I spent on toys. Upon arriving at the school for the deaf, the children seemed very excited to meet us. They were smiling and attempting to ask us questions in sign language. Fortunately, someone at the school taught me a few signs and I was happy to be able to communicate a few friendly greetings. Although learning some sign language was definitely a bonus for myself, the greater reward was being able to express my love, joy, and positive feelings to the children and to get those sentiments back from them. We were also honored by a special dance that the children had prepared to welcome us. In return, our pageant organizers brought a Christmas tree for the children, under which we placed all of the toys we had bought. When the happy children ran toward us to thank us for the presents, it was the best feeling in the world.<\/p>\n<p>At one of the other schools we visited, I was greeted by the children with heartwarming chants of “USA! USA! USA!”. It was a special moment for me as I met eyes with the children and saw their smiles as I blew them kisses. We even had a few fun and silly moments as we made funny faces back and forth. As I made this connection with the children I realized that this was what my pageant experience was all about. The children were not responding to superficial aspects of my appearance, they were responding to my personality and genuine kindness. This affected me deeply.<\/p>\n<p>Learning from loss… is winning<\/p>\n<p>My desire to win this pageant was initially fueled by the knowledge that the Miss Global organization had the resources to guide and support me in making the world a better place. During the pageant, I felt as if I had the entire nation of the Philippines rooting for me, not to mention my family, friends, and country back home. This put a tremendous amount of pressure on me and made me feel as if anything less than a title was complete failure. Hearing the encouraging cheers of people in the crowd that didn’t even know who I was, and remembering the faces of the children at the school, just added to my intense desire to win.<\/p>\n<p>When the moment came in which I was not placed in the top 20 contestants, I was obviously devastated. The disappointment was just too much for me. Staff members and other contestants encouraged me not to go back out on stage. It is at that point that I made the emotional decision to follow their advice. It seemed justified to me at the time, because many felt that the selection process had been unfair, but it is a decision that I came to regret. I regret it because the right thing to do, no matter the outcome, would have been to show support for the other women and to give a positive example of poise and strength. I know now that we all would have been better served if I had encouraged everyone to gracefully appear on stage and demonstrate to the crowd and to the judges that we were all worthy contestants. This is a lesson in grace and humility that I will never forget, and I know it will serve me well going forward.<\/p>\n<p>There are some contestants who are currently expressing negative views about the Miss Global organization because of the results of the pageant. I think that often in these types of events, it is natural to feel that after you put your heart and soul into your preparation, sacrificed so much, and invested time and money, the results seem unfair. We all need to remember that dozens of wonderful young women entered the contest, but only one can ever come away with the crown. That does not mean that the others were not worthy. What you take away from this type of experience depends on your frame of mind. This organization had many volunteers working to organize the pageant, make sure we were safe, and make sure we had everything we needed to look and feel our best. Many of these people worked long hours and very late into the night. Meanwhile, we got to have the experience of a lifetime, made wonderful friends, and we all grew together as women. This organization and all its volunteers deserve our love, support, and kindness. Now it’s up to each of us to move on individually and do our own part to make the world a better place. None of us need a crown or a sash to do that.<\/p>\n<p>Dreams and goals are dynamic… just like life<\/p>\n<p>When I was given the awesome privilege and responsibility of representing the United States at the global pageant in Manila, I explained in my sponsor letter that the winner of the pageant had a unique opportunity to contribute to the empowerment of women across the globe. To be chosen out of so many American women to represent our country was an honor that I will cherish as long as I live. What I learned from my pageant experience is that I don’t need a crown on my head to inspire the empowerment of women. I don’t need a sash to become a role model. As I continue my journey in life toward my goal of becoming a successful and financially independent entrepreneur, I know that the achievement of that goal will serve as an example for young women and girls everywhere.<\/p>\n<p>Regardless of the outcome, this pageant experience changed my life in a profound way. I was able to see another part of the world and experience another culture, I made new and lasting friendships, I learned valuable life lessons, and I even gained some fans and recognition along the way. I was able to reach many of my goals along the way, like seeing the world, growing as an individual, and having the courage to pursue my dreams. An objective of mine has been to have the courage to change my goals when I realize I want something else and to have the courage to pursue those new dreams. As my goals changed during this pageant, the experience allowed me to grow as a person and enjoy the unforgettable memories that resulted.<\/p>\n<p>When the pageant was over, I did not have the crown and I did not have the sash, but I am writing to tell you that I came away with something much more valuable. I learned lessons that I will carry with me for the rest of my life. I learned that a crown is just a piece of metal and a sash is just a piece of cloth. I learned that it was all about the journey and not the destination. It takes a lot of courage to put yourself on stage with a group of women to be judged by others. It takes hard work and dedication to practice and prepare. Along the way, I had the privilege to encounter many wonderful people, including others with similar values to mine, and similar drive, and similar dedication. What I gained in comradeship was more valuable than any title or any crown. Of all the women there, only one can take home the crown, but we can all grow stronger together. Ironically, I wonder if I would have learned these lessons if I did achieve my goal of winning the title. Perhaps in “defeat”, I gained more than I ever could have in victory.<\/p>\n<p>In closing…<\/p>\n<p>I’d like to sincerely thank the organizers, staff, and security personnel at Miss Global. I’d like to thank everyone that supported me from the makeup artists and hairstylists to my family and friends and especially my sponsors.<\/p>\n<p>There are so many things that occurred during this adventure, and so many thoughts in my head that are very difficult to put into writing. I tried to convey the most important aspects of the experience, which are the lessons that I learned about life and myself, the impact of my interaction with the children, and the new friendships that I gained. I still have so much more to say, so if any of you have any questions for me or would just like to know more about my experience, please feel free to contact me directly.<\/p>\n<p>With love,<\/p>\n<p>Miss Global USA 2016<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When I shared the news with my friends and family that I was entering the Miss Global 2016 Beauty Pageant, they were all very excited for me. The people that know me best knew that I was in it to win it, and that I would be singularly focused on bringing home the crown; and&hellip;<\/p>\n","protected":false},"author":1,"featured_media":249,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Miss USA - Nataliya Baltsevych&#039;s Journey at Miss Global 2016 in the Philippines - Miss Global Organization<\/title>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Miss USA - Nataliya Baltsevych&#039;s Journey at Miss Global 2016 in the Philippines - Miss Global Organization\" \/>\n<meta property=\"og:description\" content=\"When I shared the news with my friends and family that I was entering the Miss Global 2016 Beauty Pageant, they were all very excited for me. The people that know me best knew that I was in it to win it, and that I would be singularly focused on bringing home the crown; and&hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/\" \/>\n<meta property=\"og:site_name\" content=\"Miss Global Organization\" \/>\n<meta property=\"article:published_time\" content=\"2017-01-01T14:24:45+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-05-21T19:21:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/missglobal.com\/wp-content\/uploads\/2018\/03\/1476255833_MISSusaWEB.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"639\" \/>\n\t<meta property=\"og:image:height\" content=\"362\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/missglobal.com\/#website\",\"url\":\"https:\/\/missglobal.com\/\",\"name\":\"Miss Global Organization\",\"description\":\"Empowering Woman, Embracing Coachers, Embodying the Beauty Within\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/missglobal.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/missglobal.com\/wp-content\/uploads\/2018\/03\/1476255833_MISSusaWEB.jpg\",\"width\":639,\"height\":362},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/#webpage\",\"url\":\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/\",\"name\":\"Miss USA - Nataliya Baltsevych's Journey at Miss Global 2016 in the Philippines - Miss Global Organization\",\"isPartOf\":{\"@id\":\"https:\/\/missglobal.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/#primaryimage\"},\"datePublished\":\"2017-01-01T14:24:45+00:00\",\"dateModified\":\"2018-05-21T19:21:06+00:00\",\"author\":{\"@id\":\"https:\/\/missglobal.com\/#\/schema\/person\/6d57295abdb2188efe7b9da3a590ed8b\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/missglobal.com\/2017\/01\/miss-usa-nataliya-baltsevychs-journey-at-miss-global-2016-in-the-philippines\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/missglobal.com\/#\/schema\/person\/6d57295abdb2188efe7b9da3a590ed8b\",\"name\":\"pwsadmin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/missglobal.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9400593d4ea893b5c7ccdf7c45d1f277?s=96&d=mm&r=g\",\"caption\":\"pwsadmin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/posts\/258"}],"collection":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/comments?post=258"}],"version-history":[{"count":1,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/posts\/258\/revisions"}],"predecessor-version":[{"id":262,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/posts\/258\/revisions\/262"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/media\/249"}],"wp:attachment":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/media?parent=258"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/categories?post=258"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/tags?post=258"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}