{"id":914,"date":"2018-10-23T07:38:11","date_gmt":"2018-10-23T07:38:11","guid":{"rendered":"https:\/\/missglobal.com\/?page_id=914"},"modified":"2018-10-23T07:38:11","modified_gmt":"2018-10-23T07:38:11","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/missglobal.com\/terms-conditions\/","title":{"rendered":"TERMS &#038; CONDITIONS"},"content":{"rendered":"<p>Terms &#038; Conditions<br \/>\nPLEASE READ THESE TERMS OF USE CAREFULLY. BY USING THE SITE YOU AGREE TO THESE TERMS OF USE. IF YOU DO NOT AGREE TO THESE TERMS OF USE, PLEASE DO NOT ACCESS THE SITE.<\/p>\n<p>MISS GLOBAL ORGANIZATION, LLC TERMS OF USE<\/p>\n<p>ACCESS TO AND USE OF THIS WEBSITE IS PROVIDED BY MISS GLOBAL ORGANIZATION, LLC SUBJECT TO THE FOLLOWING TERMS AND CONDITIONS.<\/p>\n<p>1. Acceptance<\/p>\n<p>www.missglobalorganization.com (the &#8220;Website&#8221;) is a website operated by MISS GLOBAL ORGANIZATION LLC (&#8220;MGO LLC&#8221;, &#8220;we&#8221;, &#8220;us&#8221;, &#8220;our&#8221;). MISS GLOBAL ORGANIZATION LLC is a limited liability company based in California.<br \/>\nBy visiting the Website you agree, without limitation or qualification, to be bound by these terms and conditions of use (the “Terms of Use”), the MISS GLOBAL ORGANIZATION LLC Privacy Policy (the “Privacy Policy”) and the MISS GLOBAL ORGANIZATION LLC Cookies Policy (the &#8220;Cookies Policy&#8221;) incorporated herein by reference.<\/p>\n<p>Where permitted by local law, MISS GLOBAL ORGANIZATION LLC reserves the right to modify or revise the Terms of Use, in its sole discretion, at any time. By visiting and using the Website you agree to be bound by any and all subsequent modifications or revisions and to comply with any applicable laws and regulations. Any modifications or revisions we may make to the Terms of Use will be posted on this page. MISS GLOBAL ORGANIZATION LLC recommends that Website users review the most up-to-date version of the Terms of Use periodically. If you do not agree or consent to these modifications or revisions, do not continue to use the Website.<br \/>\nWe do not guarantee that the Website or the Contents (as described in more detail below), will always be available or be uninterrupted. We may suspend, withdraw, discontinue or change all or any part of the Website without notice. To the extent allowed by law, we will not be liable to you if for any reason the Website is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to the Website. You are also responsible for ensuring that all persons who access the Website through your internet connection or using your device are aware of these Terms of Use and other applicable terms and conditions, and that they comply with them.<\/p>\n<p>The materials provided on the Website are protected by applicable law, including, but not limited to, United States copyright laws and international treaties.<\/p>\n<p>2. Personal Information<\/p>\n<p>The personal information you submit to MISS GLOBAL ORGANIZATION LLC and that MISS GLOBAL ORGANIZATION LLC collects from you is governed by the MISS GLOBAL ORGANIZATION LLC Privacy Policy and Cookies Policy. To the extent there is an inconsistency between these Terms of Use and the Privacy Policy and\/or Cookies Policy, the Privacy Policy and\/or Cookies Policy as applicable shall govern. You are responsible for providing information that is accurate, current and complete.<br \/>\nIf you provide information that is not accurate, current or complete, or if MISS GLOBAL ORGANIZATION has reason to believe that information you provided is not accurate, current or complete, MISS GLOBAL ORGANIZATION has the right to prohibit you from any and all future use of the Website.<\/p>\n<p>3. Use Restrictions<br \/>\nThe content on the Website, such as text, graphics, source code, images, photographs, illustrations, trademarks, trade names, service marks, logos, information obtained from MISS GLOBAL ORGANIZATION licensors, and other materials (the “Contents”) is protected by intellectual property rights under both United States and foreign laws. Ownership of the Contents &#8211; in other words, ownership of all intellectual property rights in such Contents &#8211; remains with MISS GLOBAL ORGANIZATION LLC or our licensors. All rights not expressly granted herein are reserved to MISS GLOBAL ORGANIZATION LLC and its licensors. If you violate any of these Terms of Use, your permission to use the Contents automatically terminates and you must immediately destroy any copies you have made of any portion of the Contents.<br \/>\nAny use of the Contents not expressly permitted by these Terms of Use is a breach of these Terms of Use and may violate copyright, trademark and other laws.<\/p>\n<p>Except as otherwise stated herein, you may not, without MISS GLOBAL ORGANIZATION LLC’s written permission, “mirror” any Contents contained in the Website or any other server and you agree not to reproduce, duplicate, copy, sell, resell or exploit for any commercial purpose, any portion of the Website or the Contents other than as expressly authorized by MISS GLOBAL ORGANIZATION LLC in writing. You may not use the Website for any purpose that is unlawful or prohibited by these Terms of Use, including to defame, harass, stalk, threaten, abuse or otherwise violate the rights of a third party as defined by applicable law.<\/p>\n<p>MISS GLOBAL ORGANIZATION LLC authorizes you to view and download a single copy of the Website and the Contents, to the extent that the Contents are available on the Website. You agree that you will not remove or modify any acknowledgements, credits or legal notices contained on the Website or in the Contents. Where applicable, you shall include the following copyright notice: “Copyright © 2018, MISS GLOBAL ORGANIZATION, LLC. All rights reserved”.<br \/>\nAny special rules for the use of other items provided on the Website may be included elsewhere within the Website and are incorporated into these Terms of Use by reference. The use of the Contents on any other site or in a networked computer environment for any purpose is prohibited.<br \/>\nYou may not use the Website in any manner that could damage, disable, overburden or impair the Website, or interfere with any other party’s use and enjoyment of the Website. You may not attempt to gain unauthorized access to the Website through hacking, password mining or any other means.<\/p>\n<p>You may not reverse engineer any aspect of the Website or do anything which might discover source code or bypass or circumvent measures employed to prevent or limit access to any part of the Website. You may not attempt to circumvent any content-filtering techniques we employ or attempt to access any area of the Website that you are not authorized to access. You may not develop any third-party applications that interact with the Website without our prior written consent, including any scripts designed to scrape or extract data from the Website.<\/p>\n<p>MISS GLOBAL ORGANIZATION LLC reserves the right, in its sole discretion, to terminate your access to the Website, or any portion thereof, at any time, if there is a justifiable reason, without prior notice or any notice.<\/p>\n<p>If, for any reason, you create any derivatives, modifications or improvements to the Website, and\/or Contents (&#8220;Derivatives&#8221;), all right, title and interest (including existing and future intellectual property rights) in such Derivatives (&#8220;Derivative Rights&#8221;) vest in MISS GLOBAL ORGANIZATION LLC immediately upon creation. You hereby assign to MISS GLOBAL ORGANIZATION LLC with full title guarantee all right, title and interest in all such Derivative Rights. You represent and warrant that use by MISS GLOBAL ORGANIZATION LLC or its licensees of the Derivative Rights will not infringe the intellectual property rights or other rights of any third party. You must do all things and sign all documents necessary or desirable to give effect to this paragraph.<\/p>\n<p>4. Submission of Ideas<\/p>\n<p>MISS GLOBAL ORGANIZATION LLC does not accept submissions of any kind through the Website (e.g., materials, ideas, suggestions, know-how, or concepts, other than those expressly sought through permitted use of the Website) or otherwise. All submissions, other than those expressly sought through permitted use of the Website, may be deleted unread or destroyed, at MISS GLOBAL ORGANIZATION LLC’s discretion. You hereby grant to MISS GLOBAL ORGANIZATION LLC an irrevocable, perpetual, royalty-free licence (including the right to sublicense to third parties) to exercise the intellectual property rights in any submissions made by you or on your behalf in connection with the Website (&#8220;Licensed Submissions&#8221;). You represent and warrant that use by MISS GLOBAL ORGANIZATION LLC or its licensees of the Licensed Submissions will not infringe the intellectual property rights or other rights of any third party. You must do all things and sign all documents necessary or desirable to give effect to this paragraph.<\/p>\n<p>5. Hyperlinks from the Website<\/p>\n<p>The Website may contain hyperlinks to other websites and webpages (“Third-Party Pages”), as well as to text, graphics, videos, images, music, sounds, applications and information belonging to or originating from other third-parties (collectively, “Third-Party Applications”). MISS GLOBAL ORGANIZATION LLC does not investigate, monitor, or review any Third-Party Pages or Third-Party Applications to ensure their accuracy, completeness, or appropriateness.<br \/>\nMISS GLOBAL ORGANIZATION LLC is not responsible for the Third-Party Pages or any Third-Party Applications accessed through the Website. The inclusion of any hyperlinks to any Third-Party Pages or Third-Party Applications on the Website does not indicate MISS GLOBAL ORGANIZATION LLC’s approval or endorsement thereof. If you choose to leave the Website to access any Third-Party Pages or Third-Party Applications, you do so at your own risk.<\/p>\n<p>6. No Reliance on Information<\/p>\n<p>The material and Contents on the Website are provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on the Website.<\/p>\n<p>Although MISS GLOBAL ORGANIZATION LLC make reasonable efforts to update the information on the Website, MISS GLOBAL ORGANIZATION LLC make no representations, warranties or guarantees, whether express or implied, that the information and\/or Contents on the Website is accurate, complete or up-to-date.<\/p>\n<p>7. Liability of MISS GLOBAL ORGANIZATION LLC and Its Licensors and Partners<\/p>\n<p>The use of the Website and\/or the Contents is at your own risk. The Contents of the Website could include technical inaccuracies or typographical errors.<\/p>\n<p>MISS GLOBAL ORGANIZATION LLC may update the Website and\/or may change the Contents at any time. However, please note that any of the Content on the Website may be out of date at any given time, and MISS GLOBAL ORGANIZATION LLC are under no obligation to update it. MISS GLOBAL ORGANIZATION LLC do not guarantee that the Website or any of the Contents on it, will be free from errors or omissions.<\/p>\n<p>Subject to applicable law, MISS GLOBAL ORGANIZATION LLC will not be liable to you for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with use or inability to use, the Website or use of or reliance on any Contents displayed on the Website.<\/p>\n<p>To the extent permitted by applicable law, MISS GLOBAL ORGANIZATION LLC will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of the Website or to your downloading of any Contents on it, or on any website linked to it.<\/p>\n<p>Except as otherwise expressly permitted herein, you agree not to use the Website for any commercial or business purposes, and subject to applicable law MISS GLOBAL ORGANIZATION LLC have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity arising out of or related to your use, or the performance of the Website.<\/p>\n<p>To the extent permitted by applicable law, MISS GLOBAL ORGANIZATION LLC exclude all conditions, warranties, representation or other terms which may apply to the Website or any Contents on it, whether express or implied.<\/p>\n<p>Nothing in these Terms of Use excludes or limits MISS GLOBAL ORGANIZATION LLC&#8217;s liability for death or personal injury arising from negligence, or fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by applicable law.<\/p>\n<p>8. Indemnity<\/p>\n<p>You will be responsible for and will be liable to us and indemnify us against any loss or damage suffered by MISS GLOBAL ORGANIZATION LLC as a result of your use of the Website and\/or Contents other than as permitted under these Terms of Use.<\/p>\n<p>You agree to indemnify us in full against any third party liabilities, claims, costs, loss or damage incurred as a result of any breach by you of these Terms of Use.<\/p>\n<p>9. General<\/p>\n<p>MISS GLOBAL ORGANIZATION LLC makes no claims that the Contents and\/or Website are appropriate or may be downloaded and\/or used outside of the United States of America. Access to and use of the Website and\/or Contents may not be legal by certain persons or in certain countries.<\/p>\n<p>If you access, use and\/or download the Website and\/or Contents from outside the United States, you do so at your own risk and are responsible for compliance with the laws of your jurisdiction.<br \/>\nThe following provisions survive the expiration or termination of these Terms of Use for any reason whatsoever: Liability of MISS GLOBAL ORGANIZATION LLC and its Licensors and Partners, No Reliance on Information, Use Restrictions, Submission of Ideas, Indemnity, Viruses, Trade Marks, Applicable Laws, Waiver and Severability and Complete Agreement.<\/p>\n<p>10. Applicable Laws<\/p>\n<p>Subject to the provisions of applicable law, these Terms of Use are governed in accordance with the laws of California, United States of America, without regard to its conflict of law provisions. You and MISS GLOBAL ORGANIZATION LLC hereby expressly consent and submit to the exclusive jurisdiction of the state of California, United States of America for the adjudication or disposition of any claim, action or dispute arising out of these Terms of Use.<\/p>\n<p>11. Waiver and Severability<\/p>\n<p>If any provision of these Terms of Use is found to be invalid by any court having competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of these Terms of Use, which shall remain in full force and effect. No waiver of any of these Terms of Use shall be deemed a further or continuing waiver of such term or condition or any other term or condition.<\/p>\n<p>12. Notice and Take Down Procedures<\/p>\n<p>If you believe the Contents (or any part thereof) accessible on or from the Website infringes your intellectual property rights, you may request removal of those materials (or access thereto) from the Website by contacting MISS GLOBAL ORGANIZATION LLC (address identified below) and providing the following information:<\/p>\n<p>◦\tidentification of the work that you believe to be infringed. Please describe the work, and where possible include a copy or the location (e.g., URL) of an authorized version of the work;<br \/>\n◦\tidentification of the Content that you believe to be infringing your intellectual property rights and its location. Please describe the Content, and provide us with its URL or any other pertinent information that will allow us to locate the Content;<br \/>\n◦\tyour name, address, telephone number, and (if available) email address.<br \/>\n◦\ta statement that you have a good faith belief that the complained-of use of the work is not authorized by the intellectual property rights owner, its agent, or the law;<br \/>\n◦\ta statement that the information you have supplied is accurate, and indicating that “under penalty of perjury,” you are the intellectual property rights owner or authorized representative of the intellectual property rights owner;<br \/>\n◦\ta signature or the electronic equivalent from the intellectual property rights owner or authorized representative of the intellectual property rights owner.<\/p>\n<p>Our email for intellectual property rights issues relating to the Website is as follows:<br \/>\ninfo@missglobalorganization.com<\/p>\n<p>In an effort to protect the rights of intellectual property rights owners, MISS GLOBAL ORGANIZATION LLC maintains a policy for the termination, in appropriate circumstances, of users of the Website who are repeat infringers.<\/p>\n<p>13. Trade Marks<\/p>\n<p>MISS GLOBAL ORGANIZATION, LLC is the exclusive owner of all rights in the MISS GLOBAL “EMPOWERING WOMEN, EMBRACING CULTURES, AND EMBODYING THE BEAUTY WITHIN” trademarks, and the Woman holding the “G” Global Logo. Unauthorized use of any MISS GLOBAL ORGANIZATION, LLC trademark, service mark or logo is prohibited, and may be a violation of federal and state trademark law.<\/p>\n<p>14. Viruses<\/p>\n<p>We do not guarantee that the Website will be secure or free from bugs or viruses.<\/p>\n<p>You are responsible for configuring your information technology, computer programs and platform in order to access and use the Website. You should use your own virus protection software.<\/p>\n<p>You must not misuse the Website by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorized access to the Website, the server on which the Website is stored or any server, computer or database connected to the Website. You must not attack the Website via a denial-of-service attack or a distributed denial-of service attack. By breaching this provision, you may be committing a criminal offence under applicable law. MISS GLOBAL ORGANIZATION LLC will report any such breach to the relevant law enforcement authorities and will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use the Website will cease immediately.<\/p>\n<p>15. Complete Agreement<\/p>\n<p>Except as expressly provided in a particular notice or disclaimer posted by or on behalf of MISS GLOBAL ORGANIZATION LLC on the Website, these Terms of Use, including the MISS GLOBAL ORGANIZATION LLC Privacy Policy and Cookies Policy, constitute the entire agreement between you and MISS GLOBAL ORGANIZATION LLC with respect to the use of the Website and Contents.<\/p>\n<p>16. Contact Us<\/p>\n<p>To contact us, please email info@missglobalorganization.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms &#038; Conditions PLEASE READ THESE TERMS OF USE CAREFULLY. BY USING THE SITE YOU AGREE TO THESE TERMS OF USE. IF YOU DO NOT AGREE TO THESE TERMS OF USE, PLEASE DO NOT ACCESS THE SITE. MISS GLOBAL ORGANIZATION, LLC TERMS OF USE ACCESS TO AND USE OF THIS WEBSITE IS PROVIDED BY MISS&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>TERMS &amp; CONDITIONS - Miss Global Organization<\/title>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/missglobal.com\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"TERMS &amp; CONDITIONS - Miss Global Organization\" \/>\n<meta property=\"og:description\" content=\"Terms &#038; Conditions PLEASE READ THESE TERMS OF USE CAREFULLY. BY USING THE SITE YOU AGREE TO THESE TERMS OF USE. IF YOU DO NOT AGREE TO THESE TERMS OF USE, PLEASE DO NOT ACCESS THE SITE. MISS GLOBAL ORGANIZATION, LLC TERMS OF USE ACCESS TO AND USE OF THIS WEBSITE IS PROVIDED BY MISS&hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/missglobal.com\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Miss Global Organization\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/missglobal.com\/#website\",\"url\":\"https:\/\/missglobal.com\/\",\"name\":\"Miss Global Organization\",\"description\":\"Empowering Woman, Embracing Coachers, Embodying the Beauty Within\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/missglobal.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/missglobal.com\/terms-conditions\/#webpage\",\"url\":\"https:\/\/missglobal.com\/terms-conditions\/\",\"name\":\"TERMS & CONDITIONS - Miss Global Organization\",\"isPartOf\":{\"@id\":\"https:\/\/missglobal.com\/#website\"},\"datePublished\":\"2018-10-23T07:38:11+00:00\",\"dateModified\":\"2018-10-23T07:38:11+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/missglobal.com\/terms-conditions\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/pages\/914"}],"collection":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/comments?post=914"}],"version-history":[{"count":1,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/pages\/914\/revisions"}],"predecessor-version":[{"id":915,"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/pages\/914\/revisions\/915"}],"wp:attachment":[{"href":"https:\/\/missglobal.com\/wp-json\/wp\/v2\/media?parent=914"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}